%%%-------------------------------------------------------------------
%%% File    : db_update_operate.erl
%%% Author  :  <>
%%% Description : 在这个文件修改完毕以后, 记得修改server/ebin/db_update.cfg文件
%%% 否则将不执行该更新, 注意如果有结构上的变化, 请使用元组, 不能使用record的方式, 否则
%%% 可能会导致数据库更新异常
%%%
%%% Created :  5 Nov 2009 by  <>
%%%-------------------------------------------------------------------
-module(db_update_operate).
-include("table_info.hrl").
-include("packet_def.hrl").
%% API
-compile([export_all]).

%%====================================================================
%% API
%%====================================================================
